#include <stdio.h>

#define HEIGHT 30
#define WIDTH 30
#define THEIGHT 60
#define TWIDTH 60

char tmparr2[HEIGHT][WIDTH] = { {0}, {0} };
char arr2[HEIGHT][WIDTH] = {
	{"¡á¡à¡á¡à¡à¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á"},
	{"¡á¡à¡à¡à¡á¡á¡à¡à¡à¡á¡á¡à¡á¡á¡à"},
	{"¡á¡à¡á¡à¡à¡à¡à¡á¡à¡à¡à¡à¡á¡á¡á"},
	{"¡á¡à¡à¡á¡á¡à¡á¡á¡à¡á¡á¡à¡à¡à¡á"},
	{"¡á¡á¡á¡á¡à¡à¡à¡á¡à¡á¡á¡á¡á¡à¡à"},
	{"¡á¡á¡à¡à¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à"},
	{"¡á¡á¡à¡á¡à¡á¡á¡à¡á¡á¡à¡á¡á¡á¡á"},
	{"¡á¡á¡à¡á¡à¡á¡á¡à¡á¡á¡à¡à¡à¡á¡à"},
	{"¡á¡á¡à¡á¡à¡à¡à¡à¡á¡à¡à¡á¡à¡á¡á"},
	{"¡á¡à¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡à"},
	{"¡á¡á¡á¡à¡á¡à¡à¡à¡à¡à¡à¡á¡à¡á¡á"},
	{"¡á¡à¡á¡à¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á"},
	{"¡á¡à¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡à"},
	{"¡á¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à"},
	{"¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á"}
};
void crafting()




void MP(char map[][WIDTH], int height, int width) {
	
	for (int i = 0; i < height; i++) {
		for (int j = 0; j < width; j++) {
			printf("%c", map[i][j]);
		}
		printf("\n");
	}
	
}


int main() {

	MP(arr2, HEIGHT-15, WIDTH);
	
	
}